app/controllers/books_controller.rb

  def create
    @books = Book.all
    @book = Book.new(book_params)
    if @book.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "aa"], ["created_at", "2022-01-18 16:18:51.578314"], ["updated_at", "2022-01-18 16:18:51.578314"]]